{"pageProps":{"postData":{"id":"blog-strategie","contentHtml":"<p>Starting a fresh, new blog gives me the fear of the blank page.\nIn your mind you got all this ideas and a picture of how great this will be and how it shold look, behave and feel,\nbut starting out is nothing like it.</p>\n<p>You can get to an acceptable look of the page with very little CSS, and there are some tutorials on that - but it still needs motivation to keep pushing through. Especially in the beginning it feels easier to give up on the whole idea than pushing through when your goals for the project are much higher.</p>\n<p>For this reason I made a plan for myself that reminds me about the expectations and priorities that I have set.\nThese guidelines help me staying motivated and keep pushing forward every week:</p>\n<ol>\n<li><strong>Content is king</strong></li>\n</ol>\n<p>My most important goal is to cultivate a habit of consistent writing.\nGetting good at writing is an extremely helpful skill that can help in a lot of different areas.</p>\n<p>Explaining things as simple as possible and to write with easy to understand words is what I try to achieve. It also is a good way of teaching.</p>\n<p>And even just to write more in english is very helpful for me, since it is not my native language.</p>\n<ol start=\"2\">\n<li><strong>Form follows function</strong></li>\n</ol>\n<p>More important than a nice looking blog are</p>\n<ul>\n<li>semantic HTML</li>\n<li>accessibility</li>\n<li>rosponsiveness</li>\n<li>page loading speed</li>\n</ul>\n<p>These are the most important things a website should focus on.\nI want to work from the start with best practices in mind.\nThis helps me to understand and really learn them.</p>\n<p>Only if these points are met, I move on to add other functionality.</p>\n<ol start=\"3\">\n<li><strong>Take tiny little baby steps</strong></li>\n</ol>\n<p>Working as a frontend developer I kind of feel ashamed of having just a plain personal site.\nBut by focusing on points 1 and 2 I feel better and more comfortable in taking it slow, knowing that the foundation is solid to build upon.\nLearning in public and documenting on the way are the best value that I can give with this blog.</p>\n","title":"My plan for this blog","date":"2021-04-21"}},"__N_SSG":true}